# -*- coding: utf-8 -*-
"""Основы_Python_ДЗ_1

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1cDH-ZPyI_g6byHeMjnrDYZBL75jPtt2P

## *Задание 1*

---

Даны 2 переменных, в которых хранятся строки произвольной длины: phrase_1 и phrase_2.
Напишите код, который проверяет какая из этих строк длиннее.
"""

phrase_1 = '640Кб должно хватить для любых задач. Билл Гейтс (по легенде)'
phrase_2 = 'Насколько проще было бы писать программы, если бы не заказчики'

if len(phrase_1)>len(phrase_2):
  print('Фраза 1 длиннее фразы 2')
elif len(phrase_1)<len(phrase_2):
  print('Фраза 2 длиннее фразы 1')
else:
  print('Фразы равной длины')

"""## *Задание 2*

---

Необходимо написать программу, которая выведет, является ли год високосным или обычным.
"""

year = int(input('Введите год:'))

if year % 400 == 0:
  print('Високосный год')
elif year % 100 == 0:
  print('Обычный год')
elif year % 4 == 0:
  print('Високосный год')
else:
  print('Обычный год')

"""## *Задание 3*

---

Необходимо написать программу, которая будет запрашивать у пользователя месяц и дату рождения и выводить соответствующий знак зодиака.
"""

day = int(input('Введите день:'))
month = str(input('Введите месяц:'))

if month == 'Апрель':
  if day<=19:
    print('Ваш знак зодиака: Овен')
  else:
    print('Ваш знак зодиака: Телец')
elif month == 'Май':
  if day<=20:
    print('Ваш знак зодиака: Телец')
  else:
    print('Ваш знак зодиака: Близнецы')
elif month == 'Июнь':
  if day<=20:
    print('Ваш знак зодиака: Близнецы')
  else:
    print('Ваш знак зодиака: Рак')
elif month == 'Июль':
  if day<=22:
    print('Ваш знак зодиака: Рак')
  else:
    print('Ваш знак зодиака: Лев')
elif month == 'Август':
  if day<=22:
    print('Ваш знак зодиака: Лев')
  else:
    print('Ваш знак зодиака: Дева')
elif month == 'Сентябрь':
  if day<=22:
    print('Ваш знак зодиака: Дева')
  else:
    print('Ваш знак зодиака: Весы')
elif month == 'Октябрь':
  if day<=22:
    print('Ваш знак зодиака: Весы')
  else:
    print('Ваш знак зодиака: Скорпион')
elif month == 'Ноябрь':
  if day<=21:
    print('Ваш знак зодиака: Скорпион')
  else:
    print('Ваш знак зодиака: Стрелец')
elif month == 'Декабрь':
  if day<=21:
    print('Ваш знак зодиака: Стрелец')
  else:
    print('Ваш знак зодиака: Козерог')
elif month == 'Январь':
  if day<=19:
    print('Ваш знак зодиака: Козерог')
  else:
    print('Ваш знак зодиака: Водолей')
elif month == 'Февраль':
  if day<=18:
    print('Ваш знак зодиака: Водолей')
  else:
    print('Ваш знак зодиака: Рыбы')
elif month == 'Март':
  if day<=20:
    print('Ваш знак зодиака: Рыбы')
  else:
    print('Ваш знак зодиака: Овен')
else:
  print('Введены некорректные данные')

"""## *Задание 4*

---

Вам нужно написать программу для подбора упаковок по размерам товара. Размеры (ширина, длина, высота) хранятся в переменных (в сантиметрах):

Используйте следующие правила:

если каждое из трех измерений менее или равно 15 сантиметрам, то выведите на экран “Коробка №1”;

если хотя бы одно из измерений больше 2 метров, то выводите “Упаковка для лыж”;

если хотя бы одно из измерений больше 15 сантиметров, но менее 50 сантиметров, то выводите “Коробка №2”;

во всех остальных случаях выводите “Коробка №3”.
"""

width = int(input('Введите ширину:'))
length = int(input('Введите длину:'))
height = int(input('Введите высоту:'))

if width<=15 and length<=15 and height<=15:
  print('Коробка №1')
elif width>200 or length>200 or height>200:
  print('Коробка для лыж')
elif 15<width<50 or 15<length<50 or 15<height<50:
  print('Коробка №2')
else:
  print('Коробка №3')

"""## *Задание 5*

---

Напишите программу, которая будет определять, является ли билет “счастливым”. Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера.
"""

a = input('Введите номер билета:')

if int(a[0]) + int(a[1]) + int(a[2]) == int(a[3]) + int(a[4]) + int(a[5]):
  print('Счастливый билет')
else:
  print('Несчастливый билет')

"""## *Задание 6*

---

Напишите программу, которая сможет вычислять площади трех фигур (круг, треугольник и прямоугольник).
"""

figure = str(input('Назовите фигуру (круг, треугольник или прямоугольник):'))

if figure == 'круг':
  r = float(input('Введите радиус круга:'))
  import math
  S = math.pi * (r**2)
  print('Площадь круга:', S)
elif figure == 'треугольник':
  a = float(input('Введите длину первой стороны треугольника:'))
  b = float(input('Введите длину второй стороны треугольника:'))
  c = float(input('Введите длину третьей стороны треугольника:'))
  p = (a + b + c)/2
  S = (p * (p - a) * (p - b) * (p - c))**(0.5)
  print('Площадь треугольника:', S)
elif figure == 'прямоугольник':
  a = float(input('Введите длину первой стороны прямоугольника:'))
  b = float(input('Введите длину второй стороны прямоугольника:'))
  S = a*b
  print('Площадь прямоугольника:', S)
else:
  print('С такой фигурой я Вам не помогу')